---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResultArray.IsEmpty
source: html/29830811-8c42-0351-5f46-c16857b08991.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.